[{"model": "products.category", "pk": 1, "fields": {"name": "mens_hoodies", "friendly_name": "Mens Hoodies"}}, {"model": "products.category", "pk": 2, "fields": {"name": "mens_tops", "friendly_name": "Mens Tops"}}, {"model": "products.category", "pk": 3, "fields": {"name": "mens_bottoms", "friendly_name": "Mens Bottoms"}}, {"model": "products.category", "pk": 4, "fields": {"name": "mens_jackets", "friendly_name": "Mens Jackets"}}, {"model": "products.category", "pk": 5, "fields": {"name": "womens_hoodies", "friendly_name": "Womens Hoodies"}}, {"model": "products.category", "pk": 6, "fields": {"name": "womens_tops", "friendly_name": "Womens Tops"}}, {"model": "products.category", "pk": 7, "fields": {"name": "womens_bottoms", "friendly_name": "Womens Bottoms"}}, {"model": "products.category", "pk": 8, "fields": {"name": "womens_jackets", "friendly_name": "Womens Jackets"}}, {"model": "products.product", "pk": 1, "fields": {"category": 1, "sku": null, "name": "Nike Sportswear Club Fleece Pullover Hoodie", "description": "Cop a comfy classic with this men's Sportswear Club Fleece Hoodie from Nike. Comin' in a Peach colorway, this regular-fit hoodie is cut from ultra-smooth brushed fleece for a cozy feel that keeps ya warm. In an overhead style, it features a hood with adjustable drawcords and long sleeves for added coverage, with ribbed trims for an optimized fit. With a central kangaroo pocket for essential storage, this hoodie is finished up with signature Nike branding at the chest. Machine washable. | Our model is 5'11\" with a 38\" chest and wears a size medium.", "has_sizes": true, "price": "50.00", "rating": "5.00", "image_url": null, "image": "nikeorangehoodie.jfif"}}, {"model": "products.product", "pk": 2, "fields": {"category": 1, "sku": null, "name": "Emporio Armani EA7 Core Box Hoodie", "description": "Keep it casual when kickin' back off-duty with this men's Core Box Hoodie from Emporio Armani EA7. In a smooth Black colorway, this hoodie is made from super-soft cotton for next-level comfort every time you rep it. It features an adjustable hood for custom coverage, with ribbed trims that optimize the fit and keep it secure. With a kangaroo pouch for all your street-ready essentials, this hoodie is finished up with an Emporio Armani EA7 box logo on the chest. Machine washable | Our model is 6'2\" with a 38\" chest and wears a size medium.", "has_sizes": true, "price": "90.00", "rating": "5.00", "image_url": null, "image": "ea7boxhoodie.jfif"}}, {"model": "products.product", "pk": 3, "fields": {"category": 1, "sku": null, "name": "Nike Court Hoodie", "description": "Layer up in a street style with this men's Court Hoodie from Nike. In a fresh white colorway, this hoodie is made with super-soft fleece fabric for premium comfort. In an overhead style, this standard-fit hoodie features an adjustable hood for a custom look, with ribbed trims and a kangaroo pocket to the front. Signed off with a multi-Swoosh graphic stamped to the chest. Machine washable. | Our model is 6'2\" with a 38\" chest and wears a size medium.", "has_sizes": true, "price": "50.00", "rating": "4.80", "image_url": null, "image": "nikecourthoodie.jfif"}}, {"model": "products.product", "pk": 4, "fields": {"category": 1, "sku": null, "name": "Nike Tape Hoodie", "description": "Layer up in retro-inspired style with this men's Tape Hoodie from Nike. In a Black colorway, this regular-fit hoodie is made from soft, midweight cotton fleece for premium comfort. In an overhead style, it features long sleeves with ribbed trims and adjustable drawstrings to the hood for a custom look. With a central kangaroo pocket, this hoodie is signed off with taping to the sleeves and signature Nike Swoosh branding to the chest and back. Machine washable. | Our model is 6'2\" with a 38\" chest and wears a size medium.", "has_sizes": true, "price": "60.00", "rating": "4.50", "image_url": null, "image": "niketapehoodie.jfif"}}, {"model": "products.product", "pk": 5, "fields": {"category": 1, "sku": null, "name": "Nike Foundation Hoodie", "description": "A wardrobe staple, the Nike Sportswear Club Fleece Pullover Hoodie combines classic style with the soft comfort of fleece.", "has_sizes": true, "price": "50.00", "rating": "3.80", "image_url": null, "image": "nikefoundationhoodie.jfif"}}, {"model": "products.product", "pk": 6, "fields": {"category": 1, "sku": null, "name": "Nike Jordan 23 Engineered Men's Fleece Pullover Hoodie", "description": "Prepare for winter in the city with the Jordan 23 Engineered Pullover Hoodie. Made from softly brushed fabric, it has an easy feel that layers well under a jacket.", "has_sizes": true, "price": "110.00", "rating": "4.80", "image_url": null, "image": "jordan23hoodie.jfif"}}, {"model": "products.product", "pk": 7, "fields": {"category": 1, "sku": null, "name": "Nike Air Max Poly Knit Full Zip Hoodie", "description": "Get prepped for the cooler temperatures with the Swoosh in this men's Air Max Poly Knit Full Zip Hoodie from Nike. In a Black colourway, this standard-fit, Adz Garmz exclusive hoodie is made from thick, double-knit polyester for a warm, comfy feel. Perf' for layering up, it features a full zip fastening and adjustable hood so you can personalise the coverage while the long sleeves and ribbed trims optimize the fit and trap in the heat. With zippered pockets for essential storage, this hoodie is signed off with Air Max branding and a Nike Swoosh to the chest. Machine washable | Our model is 6'0\" with a 38\" chest and wears a size medium.", "has_sizes": true, "price": "80.00", "rating": "5.00", "image_url": null, "image": "airmaxhoodie.jfif"}}, {"model": "products.product", "pk": 8, "fields": {"category": 2, "sku": null, "name": "The North Face Simple Dome T-Shirt Beige", "description": "Top up your street edge with an Adz Garmz exclusive in this men's Simple Dome T-Shirt from The North Face. In a Kelp colorway, this standard-fit essential is made from soft and durable cotton for everyday comfort. Featuring a classic crew neckline and short sleeves, it's signed off with signature TNF branding to the chest and back. Machine washable. | Our model is 6'0\" with a 40\" chest and wears a size medium.", "has_sizes": true, "price": "22.00", "rating": "3.80", "image_url": null, "image": "northfaceshirtbeige.jfif"}}, {"model": "products.product", "pk": 9, "fields": {"category": 1, "sku": null, "name": "Nike Flex Pro Training Hoodie", "description": "Step up your workout looks for the colder days in this men's Flex Pro Training Hoodie from Nike. In a Khaki colorway, this standard-fit hoodie is made from lightweight yet durable Flex fabric that stretches as you move for constant comfort. It uses Dri-FIT tech to wick away sweat and keep you dry and features a full zip fastening, an adjustable drawcord hood, and elasticated trims for premium coverage. With front pockets for your essentials, this top is finished with a contrasting Swoosh logo to the chest. Machine washable. | Our model is 6'0\" with a 38.5\" chest and wears a size medium.", "has_sizes": true, "price": "65.00", "rating": "4.10", "image_url": null, "image": "nikeflexprohoodie.jfif"}}, {"model": "products.product", "pk": 10, "fields": {"category": 1, "sku": null, "name": "Nike Nike Dri-FIT Men's Pullover Training Hoodie", "description": "The Nike Dri-FIT Hoodie is made from 100% sustainable materials, using a blend of both recycled polyester and organic cotton fibres. The blend is at least 10% recycled fibres or at least 10% organic cotton fibres. Sweat-wicking technology helps you stay dry before, during or after your workout. This product is made from 100% sustainable materials, using a blend of both recycled polyester and organic cotton fibres. The blend is at least 10% recycled fibres or at least 10% organic cotton fibres.", "has_sizes": true, "price": "40.00", "rating": "3.40", "image_url": null, "image": "nikedrifithoodie.jfif"}}, {"model": "products.product", "pk": 11, "fields": {"category": 1, "sku": null, "name": "Nike Nike F.C. Men's Pullover Fleece Football Hoodie", "description": "The Nike F.C. Hoodie keeps you comfortable in football-inspired style made from soft fleece. Stretchy sleeve cuffs and an adjustable hood help hold in warmth from pitch to pavement.", "has_sizes": true, "price": "55.00", "rating": "3.60", "image_url": null, "image": "nikefchoodie.jfif"}}, {"model": "products.product", "pk": 12, "fields": {"category": 2, "sku": null, "name": "EA7 Visibility Logo T-Shirt", "description": "Cop a premium staple with this men's Visibility Logo T-Shirt from Emporio Armani EA7. This standard-fit tee comes in a Black colorway and is made from soft cotton fabric to give you maximum comfort that'll last throughout the day. It features a crew neckline with short sleeves for a classic look. It's signed off with famous Emporio Armani EA7 branding to the chest. Machine washable. | Our model is 6'0\" with a 38.5\" chest and wears a size medium.", "has_sizes": true, "price": "55.00", "rating": "5.00", "image_url": null, "image": "ea7vistshirtblack.jfif"}}, {"model": "products.product", "pk": 13, "fields": {"category": 2, "sku": null, "name": "Nike Academy Shield T-Shirt", "description": "Level up your training gear in this men's Academy Shield T-Shirt from Nike. Cut from a smooth, lightweight poly fabric with sweat-wicking tech, this slim-fit tee features a round neckline and short sleeves for a tailored, streamlined look. Comin' in a Blue Void colorway, this tee is signed off with a signature Swoosh logo printed to the chest. Machine washable. | Our model is 6'2\" with a 38\" chest and wears a size medium.", "has_sizes": true, "price": "25.00", "rating": "4.00", "image_url": null, "image": "nikeacademyshieldshirt.jfif"}}, {"model": "products.product", "pk": 14, "fields": {"category": 2, "sku": null, "name": "Nike Dri-FIT Camo Training T-Shirt", "description": "Smash PB's with this men's Dri-FIT Camo Training T-Shirt by Nike. In a Smoke Grey colorway with an all-over camo print, this regular-fit T-shirt has a crewneck and short sleeves. Featuring Dri-FIT tech to wick away moisture keeping you cool when working out, it's finished with the famous Swoosh to the chest. Machine washable. | Our model is 5'10\" with a 37\" chest and wears a size medium.", "has_sizes": true, "price": "25.00", "rating": "4.00", "image_url": null, "image": "nikecamoshirt.jfif"}}, {"model": "products.product", "pk": 15, "fields": {"category": 2, "sku": null, "name": "Nike Miler Short Sleeve T-Shirt", "description": "Make sure you're unmissable at night in the men's Miler UV T-Shirt from Nike. Made with breathable UV-blocking fabric that pulls sweat away from the skin, the tee helps you stay dry and comfortable while protecting you from the sun's harmful rays while reflective branding works once the sun goes down. It features Dri-FIT UV fabric to help keep you dry and comfortable while helping to protect against UV rays. Finished with a Swoosh to the chest. Machine washable. | Our model is 6'0\" with a 38\" chest and wears a size medium.", "has_sizes": true, "price": "30.00", "rating": "4.60", "image_url": null, "image": "nikemilertshirt.jfif"}}, {"model": "products.product", "pk": 16, "fields": {"category": 2, "sku": null, "name": "Jordan Central Logo T-Shirt", "description": "For cool comfort that pays homage to the GOAT, check out this men's Central Logo T-Shirt from Jordan. In a White colorway, this standard-fit tee is made from a soft poly-cotton blend with Dri-FIT tech to wick away sweat and keep you comfy. It features a classic crew neckline and short sleeves. Finished with the iconic Jordan Jumpman logo on the chest. Machine washable. | Our model is 5'11\" with a 38\" chest and wears a size medium.", "has_sizes": true, "price": "23.00", "rating": "4.50", "image_url": null, "image": "jordanshirtwhite.jfif"}}, {"model": "products.product", "pk": 17, "fields": {"category": 2, "sku": null, "name": "Emporio Armani EA7 Core Short Sleeve T-Shirt", "description": "For premium, everyday comfort, check out this men's Core Short Sleeve T-Shirt from Emporio Armani EA7. In a timeless white colorway, this regular-fit tee is made from 100% cotton for maximum, off-duty comfort. It features a ribbed crew neckline and short sleeves. This tee is finished with signature EA7 silicone branding printed to the chest in black. Machine washable. | Our model is 6'2\" with a 40\" chest and wears a size medium.", "has_sizes": true, "price": "40.00", "rating": "4.90", "image_url": null, "image": "ea7whiteshirt.jfif"}}, {"model": "products.product", "pk": 18, "fields": {"category": 2, "sku": null, "name": "Jordan Essentials Statement T-Shirt", "description": "Hit the courts with a classic look from Jordan in this men's Essentials Statement T-Shirt. Landing in a Hemp colorway, this standard-fit tee is built from soft cotton for comfort that lasts. It features a crew neckline, dropped shoulder, and short sleeves. Finished up with an iconic Jumpman embroidered to the sleeve and 'FLIGHT' to the chest. Machine washable. | Our model is 6'0\" with a 38\" chest and wears a size medium.", "has_sizes": true, "price": "35.00", "rating": "3.75", "image_url": null, "image": "jordanflightshirt.jfif"}}, {"model": "products.product", "pk": 19, "fields": {"category": 2, "sku": null, "name": "Nike Pro T-Shirt", "description": "Take ya' training up a level in this men's Pro T-Shirt from Nike. In a slick black colorway, this tight-fit tee is made with super-smooth, lightweight poly fabric with added stretch for essential comfort during workouts. Built-in Dri-FIT tech wicks away sweat and keeps you cool, with mesh panels in high-heat areas for added breathability. This tee features a round neckline and short sleeves, with vents at the hem for maximum movement and a slightly dropped back to keep you covered. Signed off with a signature Swoosh outlined at the chest and Nike Pro branding to the neckline. Machine washable. | Our model is 6'2\" with a 38\" chest and wears a size medium.", "has_sizes": true, "price": "27.00", "rating": "3.30", "image_url": null, "image": "nikeproshirt.jfif"}}, {"model": "products.product", "pk": 20, "fields": {"category": 2, "sku": null, "name": "Nike Rise 365 Run Division T-Shirt", "description": "Up ya' fitness game with this men's Rise 365 Run Division T-Shirt from Nike. This regular-fit tee comes in a Thunder Blue colorway and is built from smooth, lightweight poly fabric that's equipped with Dri-FIT tech that works to wick away sweat and can keep you cool. It features a crew neckline, short sleeves for a classic look, and reflective strips for essential visibility on night-time runs. It's signed off with a Swoosh to the sleeve. Machine washable. | Our model is 6'0\" with a chest size of 38.5\".", "has_sizes": true, "price": "40.00", "rating": "4.00", "image_url": null, "image": "nike365shirt.jfif"}}, {"model": "products.product", "pk": 21, "fields": {"category": 3, "sku": null, "name": "Nike Chariot Fleece Joggers", "description": "Level up your weekend essentials with these men's Chariot Fleece Joggers from Nike. Comin' in a Black colorway, these regular-fit joggers are made with super-soft cotton-blended fleece fabric for durable, cozy comfort. They feature an elasticated waistband and ribbed cuffs for the perfect fit, and side pockets for easy storage. With a White panel at the leg, these joggers have signed off with signature Nike branding at the thigh. Machine washable. | Our model is 5'11\" and wears a size medium.", "has_sizes": true, "price": "40.00", "rating": "4.50", "image_url": null, "image": "nikechariotjoggers.jfif"}}, {"model": "products.product", "pk": 22, "fields": {"category": 3, "sku": null, "name": "The North Face Fine Box Joggers", "description": "Kick back on weekend chill days with these men's Fine Box Joggers from The North Face. In a Gym Grey colorway, these joggers are made from ultra-soft, fleece fabric for premium comfort whenever you rep 'em. They feature an elasticated waistband for a relaxed fit, with ribbed ankle cuffs for an optimized fit that traps in the heat. Comin' with side pockets for your essential bits, these joggers are signed off with The North Face branding to the thigh and calf. Machine washable | Our model is 6'0\" and wears a size medium.", "has_sizes": true, "price": "65.00", "rating": "4.85", "image_url": null, "image": "northfaceboxjoggers.jfif"}}, {"model": "products.product", "pk": 23, "fields": {"category": 3, "sku": null, "name": "Nike Tech Joggers", "description": "Whether you're steppin' out or kickin' back, cop these men's Tech Joggers from Nike. In a Black colorway with Dark Grey Heather panels, these joggers are made with super-smooth cotton-blended fabric with lightweight Tech Fleece for premium comfort. These joggers are roomy at the thighs with tapered legs and cuffed ankles for an optimized fit. They feature an elasticated waistband with adjustable drawcords for a snug feel, and zippered pockets to hold the essentials. Signed off with signature Nike Swoosh branding at the thigh. Machine washable. | Our model is 5'11\" and wears a size medium.", "has_sizes": true, "price": "80.00", "rating": "5.00", "image_url": null, "image": "niketechjoggers.jfif"}}, {"model": "products.product", "pk": 24, "fields": {"category": 3, "sku": null, "name": "Nike Next Gen Academy Track Pants", "description": "Glide past opponents in style with these men's NextGen Academy Pants from Nike. In a black colorway, these JD-exclusive pants come in a standard fit and are built from smooth poly-knit fabric that uses Dri-FIT tech to wick sweat from the skin. They feature an elasticated waist with hidden drawcords for adjustable wear, as well as zippered ankles for a streamlined vibe. With zip pockets for your essentials, these pants are finished with a Volt Swoosh logo to the thigh. Machine washable. | Our model is 5'11\" and wears a size medium.", "has_sizes": true, "price": "35.00", "rating": "3.80", "image_url": null, "image": "nikeacadmeypants.jfif"}}, {"model": "products.product", "pk": 25, "fields": {"category": 3, "sku": null, "name": "Nike Tech Woven Utility Track Pants", "description": "Hit the streets with all bases covered in these men's Tech Woven Utility Track Pants from Nike. In a Rough Green colorway, these standard-fit pants are made from lightweight, durable polyester for a cool, comfy feel. With a roomy fit around the thighs and a tapered leg for a tailored fit, these pants feature an elasticated waistband, zip-up fly, and adjustable drawcord to customize your wear. With side and zip-up utility pockets for plenty of storage, these pants are finished up with Nike Swoosh branding to the thigh. Machine washable | Our model is 6'0\" and wears a size medium.", "has_sizes": true, "price": "95.00", "rating": "3.85", "image_url": null, "image": "niketechwovengreenpants.jfif"}}, {"model": "products.product", "pk": 26, "fields": {"category": 3, "sku": null, "name": "Nike Jordan Dri-FIT Air Men's Trousers", "description": "Enjoy the best of both worlds in the Jordan Dri-FIT Air Trousers. Soft and slim with sweat-wicking technology to help keep you dry, they offer easy comfort you can hoop in.Zip pockets give you convenient and secure storage. This product is made from at least 50% recycled polyester fibers.", "has_sizes": true, "price": "73.00", "rating": "4.60", "image_url": null, "image": "jordandrifittrousers.jfif"}}, {"model": "products.product", "pk": 27, "fields": {"category": 3, "sku": null, "name": "Nike Hybrid Joggers", "description": "Freshen up your off-duty essentials with these men's Hybrid Joggers from Nike. In a grey colorway with white stripes down the side, these regular-fit joggers are made from durable cotton fabric for a super-comfy feel. They feature ribbed cuffs for a tapered leg, as well as an elasticated drawcord waistband for a customized fit. With zipped side pockets to lock away your valuables, these sweats are finished with signature Nike branding to the thigh. Machine washable. | Our model is 6'0\" and wears a size medium.", "has_sizes": true, "price": "60.00", "rating": "4.05", "image_url": null, "image": "nikehybridbottoms.jfif"}}, {"model": "products.product", "pk": 28, "fields": {"category": 3, "sku": null, "name": "Nike Woven Utility Pants", "description": "Level up ya' look in these men's Woven Utility Pants from Nike. In a black colorway, these track pants are made with durable, unlined cotton-blend fabric, with a roomy fit to layer up. They feature an elasticated waistband with adjustable drawcords for a custom feel. These track pants have 2 side pockets and cargo pockets to the legs, with double-needle stitching at the pocket flaps to hold the shape. Signed off with Nike's heritage Futura logo stitched to the thigh. Machine washable. | Our model is 6'2\" and wears a size medium.", "has_sizes": true, "price": "60.00", "rating": "4.15", "image_url": null, "image": "nikewovenutilitypants.jfif"}}, {"model": "products.product", "pk": 29, "fields": {"category": 3, "sku": null, "name": "Nike Repeat Tape Joggers", "description": "Keep it casual in these men's Repeat Poly Track Pants from Nike. In a red colorway for a standout look, these track pants are made with smooth knit poly fabric for a streamlined finish, with tapered legs and ribbed cuffs for a sleek look. They feature an elasticated waist with a drawcord for a custom fit and 2 side pockets for the essentials. Finished up with repeat Nike branding down the legs for a track-inspired look and the iconic logo to the thigh. Machine washable. | Our model is 6'0\" and wears a size medium.", "has_sizes": true, "price": "50.00", "rating": "4.00", "image_url": null, "image": "nikerepeatjoggers.jfif"}}, {"model": "products.product", "pk": 30, "fields": {"category": 3, "sku": null, "name": "Nike Foundation Pintuck Joggers", "description": "Cop some classic comfy with these men's Foundation Pintuck Joggers from Nike. Landing in an Ironstone colorway, these regular-fit joggers are made with super-soft cotton-poly fabric for lightweight comfort on chilled days. They feature an elasticated waistband for a snug fit and have a tapered design for a clean, streamlined look. They have side pockets for essential storage, finished up with pintuck detailing and signature Swoosh branding at the thigh. Machine washable. | Our model is 5'11\" and wears a size medium.", "has_sizes": true, "price": "50.00", "rating": "3.95", "image_url": null, "image": "nikepintuckjoggers.jfif"}}, {"model": "products.product", "pk": 31, "fields": {"category": 4, "sku": null, "name": "Nike Legacy Therma-FIT Jacket", "description": "Level up your winter essentials with this men's Legacy Therma-FIT Jacket from Nike. Built from water-repellent ripstop fabric, this lightweight yet durable coat uses Therma-FIT tech and a fleece lining to lock in the heat without adding weight. It comes in a black colorway and features a full zip fastening and raised hood for premium coverage, as well as elasticated trims and snap-button pockets. With a contrasting zippered chest pocket for your street essentials, this jacket is finished with signature Nike Swoosh branding on the chest. Machine washable. | Our model is 5'11\" with a 38\" chest and wears a size medium.", "has_sizes": true, "price": "95.00", "rating": "4.00", "image_url": null, "image": "nikethermafitjacket.jfif"}}, {"model": "products.product", "pk": 32, "fields": {"category": 4, "sku": null, "name": "Nike Hybrid Jacket", "description": "Level up your Winter wardrobe with this men's Hybrid Jacket by Nike. Exclusive to JD, this regular-fit jacket comes in a Cool Grey colorway and is made from smooth poly-fabric for a soft feel that gives maximum comfort. It has a full zip, an adjustable hood, and two large zip side pockets to keep your hands warm or store your essentials. This must-have jacket features a water-repellent finish to keep you dry for longer. Finished with the famous Swoosh to the chest. | Our model is 5'10\" with a 37\" chest and wears a size medium.", "has_sizes": true, "price": "130.00", "rating": "4.95", "image_url": null, "image": "nikehybridgreyjacket.jfif"}}, {"model": "products.product", "pk": 33, "fields": {"category": 4, "sku": null, "name": "The North Face 1985 Marble Jacket", "description": "Cover up from the elements with this men's 1985 Marble Jacket from The North Face. In a Blue Marble Balsam Green Wooden Tiger print, this jacket is made from light, water-resistant polyester for a dry, comfy feel. It features elasticated cuffs that trap in the heat to keep you warm, with a zip-up fastening and fixed hood for coverage. This jacket can be packed away into its own sleeve and comes with zipped pockets that provide secure storage for your essentials. Signed off with The North Face branding to the chest. | Our model is 6'2\" with a 34.5\" chest and wears a size medium.", "has_sizes": true, "price": "85.00", "rating": "4.30", "image_url": null, "image": "northfacemarblejacket.jfif"}}, {"model": "products.product", "pk": 34, "fields": {"category": 4, "sku": null, "name": "The North Face Lhotse Down Jacket", "description": "Stay cozy on those colder days with this men's Lhotse Down Jacket from The North Face. In a padded block design, this regular-fit jacket is made from lightweight yet durable insulated goose down for snug comfort. Landing in a black colourway, it features a full-zip front and mock neck, as well as elasticated cuffs for locked-in heat. With side pockets for your essentials, this coat is finished with contrasting TNF branding to the chest, back and sleeve. Machine washable. | Our model is 5'10\" with a 37\" chest and wears a size medium.", "has_sizes": true, "price": "260.00", "rating": "5.00", "image_url": null, "image": "northfacelhotsejacket.jfif"}}, {"model": "products.product", "pk": 35, "fields": {"category": 4, "sku": null, "name": "Nike Windrunner Jacket", "description": "Grab a staple item for your wardrobe with this Windrunner Jacket from Nike. This standard-fit jacket comes in a Light Bone colorway and is crafted from smooth poly fabric which is durable and comfortable. It features a full zip fastening and hood with drawcords so you can get custom coverage whilst the ribbed cuffs give a secure feel and fit. With mesh lining to keep out the cold and side pockets for your essentials, it has the iconic chevron design and is finished with famous Nike branding to the chest. Machine washable. | Our model is 6'0\" with a 40\" chest and wears a size medium.", "has_sizes": true, "price": "70.00", "rating": "3.60", "image_url": null, "image": "nikewindrunner.jfif"}}, {"model": "products.product", "pk": 36, "fields": {"category": 4, "sku": null, "name": "Nike Jordan Essentials Men's Woven Jacket", "description": "Rep it retro on the court with this men's Essential Woven Jacket from Jordan. Coming in a black colorway with Gym Red panels throughout, this regular-fit windbreaker is made from lightweight and durable woven nylon. Built with a water-repellent finish to keep you dry, it features a mesh lining for cool comfort and a two-way zipped front for a customized look. An adjustable drawcord hood adds premium coverage, while elasticated trims and zipped pockets optimize the look. This jacket is signed off with an iconic Jumpman to the chest. Machine washable. | Our model is 6'0\" with a 40\" chest and wears a size medium.", "has_sizes": true, "price": "80.00", "rating": "3.80", "image_url": null, "image": "jordanwovenredjacket.jfif"}}, {"model": "products.product", "pk": 37, "fields": {"category": 4, "sku": null, "name": "Nike Packable Lightweight Jacket", "description": "Tackle the elements when out on the roads with this men's Packable Lightweight Jacket from Nike. In a Game Royal and Obsidian colorway, this retro-inspired running jacket is made from a lightweight poly fabric with added stretch to keep you covered. It uses water-repellent tech to keep you dry, with mesh panels in the back for cool comfort when the training heats up. It features a full-zip front and hood for added coverage, as well zippered pockets and elasticated trims. With a packable pouch that goes over the shoulder, this jacket is finished with reflective strips and a signature Swoosh logo. Machine washable. | Our model is 6'2\" with a 38\" chest and wears a size medium.", "has_sizes": true, "price": "90.00", "rating": "4.25", "image_url": null, "image": "nikelightweightjacket.jfif"}}, {"model": "products.product", "pk": 38, "fields": {"category": 4, "sku": null, "name": "Nike Nike Sportswear Men's Woven Jacket", "description": "The Nike Sportswear Jacket is made from a durable woven fabric ready for world travel. This traditional bomber jacket silhouette features a repeated Nike graphic on the chest and Nike World Tour details on the lower back panel.", "has_sizes": true, "price": "70.00", "rating": "3.75", "image_url": null, "image": "nikewovenbomberjacket.jfif"}}, {"model": "products.product", "pk": 39, "fields": {"category": 4, "sku": null, "name": "Nike Tribute Track Top", "description": "Layer up when the temp drops with this men's Tribute Track Top from Nike. In a Moon Fossil and Light Bone colorway, this top is made from smooth, lightweight knit polyester for a comfy feel. It features a full-zip fastening, funnel neck collar, and long sleeves for premium coverage, while the stretch-ribbed trims optimize the fit and trap in the heat to keep you warm. With side and chest pockets for essential storage, this top is finished up with Nike branding to the chest. Machine washable | Our model is 6'0\" with a 38\" chest and wears a size medium.", "has_sizes": true, "price": "65.00", "rating": "5.00", "image_url": null, "image": "niketributejacket.jfif"}}, {"model": "products.product", "pk": 40, "fields": {"category": 4, "sku": null, "name": "Nike Legacy Therma-FIT Gilet", "description": "Layer up with signature street style in this men's Legacy Therma-FIT Gilet from Nike. In a black colourway, this regular-fit vest is made from durable ripstop fabric that uses Therma-FIT tech to trap in heat. It features a fleece lining for snug comfort, as well as full zip front, raised collar and elasticated trims. With snap-button side pockets and a zippered chest pocket to lock away your essentials, this gilet is finished with heritage-inspired Swoosh branding to the chest and back. Machine washable. | Our model is 5'11\" with a 38\" chest and wears a size medium.", "has_sizes": true, "price": "75.00", "rating": "4.80", "image_url": null, "image": "nikethermagilet.jfif"}}, {"model": "products.product", "pk": 41, "fields": {"category": 5, "sku": null, "name": "The North Face Oversized Hoodie", "description": "Keep the vibes chilled in this women's Oversized Hoodie from The North Face. Coming in a sleek Black colorway, this loose-fit hoodie is made with super-soft, durable cotton for lasting comfort. With a classic pullover design, it has an adjustable hood for custom coverage and long, baggy sleeves for an easy feel. With ribbed trims to optimize the fit, this hoodie is signed off with iconic TNF branding to the chest and reverse shoulder. Machine washable. | Our model is 5'8\" and wears a size small.", "has_sizes": true, "price": "80.00", "rating": "5.00", "image_url": null, "image": "northfaceoverhoodieW.jfif"}}, {"model": "products.product", "pk": 42, "fields": {"category": 5, "sku": null, "name": "Nike Trend Poly Hoodie", "description": "Cop a casual vibe with this women's Trend Poly Hoodie from Nike. In a Black colorway, this hoodie is made from light, durable polyester for smooth comfort whenever you rep it. It features an adjustable hood for custom coverage, with a baggy, oversized cut for an ultra roomy fit. Ribbed trims keep the garm securely in place, while a kangaroo pouch lets you store your essential bits. This hoodie is signed off with Nike branding and \"Just Do It\" to the chest. Machine washable | Our model is 5'8\" and wears a size small.", "has_sizes": true, "price": "60.00", "rating": "4.00", "image_url": null, "image": "nikepollyhoodieW.jfif"}}, {"model": "products.product", "pk": 43, "fields": {"category": 5, "sku": null, "name": "Champion Core Logo Overhead Hoodie", "description": "Refresh your laidback looks with this women's Core Logo Overhead Hoodie from Champion. In a Bark colorway, this sweat is made from ultra-soft cotton for long-lasting comfort. It comes in a regular-fit and features an adjustable drawcord hood for custom coverage, as well as long sleeves, ribbed trims, and a central kangaroo pocket. This hoodie is signed off with a classic Champion logo and signature branding on the chest. Machine washable. | Our model is 5'7\" and wears a size small.", "has_sizes": true, "price": "55.00", "rating": "4.25", "image_url": null, "image": "championcorehoodieW.jfif"}}, {"model": "products.product", "pk": 44, "fields": {"category": 5, "sku": null, "name": "Nike Colour Block Pullover Hoodie", "description": "The Nike Sportswear Hoodie is made from a semi-brushed-back fleece for added softness and comfort. Colour-blocking and an oversized fit work together to create a carefree, casual feel.", "has_sizes": true, "price": "55.00", "rating": "3.60", "image_url": null, "image": "nikecolorblockhoodieW.jfif"}}, {"model": "products.product", "pk": 45, "fields": {"category": 5, "sku": null, "name": "Tommy Hilfiger '85 Logo Full Zip Hoodie", "description": "Layer up in a retro style with this women's '85 Logo Full-Zip Hoodie from Tommy Hilfiger. Comin' in a crisp white colorway, this hoodie is cut from super-soft cotton with added stretch for premium comfort. It features a full-length zipper and adjustable drawcords to the hood for custom coverage, with long-sleeved and ribbed trims. This hoodie has a standard fit and a slightly cropped hem for an updated look with laid-back vibes. Signed off with the iconic '85 logo in red to the chest, and the signature Tommy flag at the front. Machine washable. | Our model is 5'7\" and wears a size small.", "has_sizes": true, "price": "70.00", "rating": "5.00", "image_url": null, "image": "tommyhilfigerhoodieW.jfif"}}, {"model": "products.product", "pk": 46, "fields": {"category": 5, "sku": null, "name": "Nike Sustainable Fleece Overhead Hoodie", "description": "Kick back and chill in this women's Sustainable Fleece Overhead Hoodie from Nike. In a Deep Royal Blue colorway, this loose-fitting hoodie is made from super-soft, fleece French terry fabric for all-day comfort on off-duty days. It features an adjustable hood for custom coverage, with long sleeves and ribbed trims that keep the fit secure. With slightly dropped shoulders for added comfy, this hoodie is finished up with a Swoosh to the chest. Machine washable | Our model wears a size small.", "has_sizes": true, "price": "50.00", "rating": "4.00", "image_url": null, "image": "nikesushoodieW.jfif"}}, {"model": "products.product", "pk": 47, "fields": {"category": 5, "sku": null, "name": "adidas Originals Adicolor Classics Satin Tape Cropped Hoodie", "description": "It's time to upgrade that old hoodie in the back of your closet. This one from Adidas keeps all the best elements of the OG (like that crazy fuzzy feel on the inside). The cropped length and satin 3-Stripes update the look. Pair it with high-waisted tights for serious drama, or layer it over a dress for that laid-back, effortless look. By buying cotton products from us, you're supporting more sustainable cotton farming.", "has_sizes": true, "price": "100.00", "rating": "4.30", "image_url": null, "image": "adidasornbluehoodieW.jfif"}}, {"model": "products.product", "pk": 48, "fields": {"category": 5, "sku": null, "name": "The North Face Coordinates Crop Hoodie", "description": "Layer up and turn heads in this women's Coordinates Crop Hoodie from The North Face. In a Black colorway, this standard-fit hoodie is made from super soft cotton fleece. It comes in an overhead design and features a cropped hem and an adjustable hood for cozy coverage. With ribbed trims to optimize the fit, this hoodie is finished with a bold yellow box graphic to the chest with signature TNF branding. Machine washable. | Our model is 5'5\" and wears a size small.", "has_sizes": true, "price": "70.00", "rating": "4.80", "image_url": null, "image": "northfacecocrophoodieW.jfif"}}, {"model": "products.product", "pk": 50, "fields": {"category": 5, "sku": null, "name": "JUICY COUTURE Crop Hoodie", "description": "Step up ya off-duty looks with this women's Crop Hoodie from Juicy Couture. Comin' in a Light Blue colorway, this hoodie is made with smooth velour poly fabric with extra stretch for essential comfort. In a pullover style, it features a hood with adjustable drawcords and long sleeves with ribbed trims. It has a cropped hem to elevate ya' look, and a central kangaroo pocket for added storage. Signed off with the iconic Juicy logo in diamante to the reverse, and a small logo at the chest. Machine washable. | Our model is 5'7\" and wears a size small.", "has_sizes": true, "price": "70.00", "rating": "4.40", "image_url": null, "image": "juicycouturecrophoodieW.jfif"}}, {"model": "products.product", "pk": 51, "fields": {"category": 5, "sku": null, "name": "Nike Essential Overhead Hoodie Dress", "description": "Add a versatile vibe this season in this women's Essential Overhead Hoodie Dress from Nike. Hittin' above the knee for added coverage, this oversized hoodie comes in an Archaeo Pink colorway and features an adjustable drawcord hood, ribbed trims, and raglan sleeves. Made from soft cotton fabric for a supreme feel, this sweat is signed off with a signature Nike Futura logo embroidered to the chest. Machine washable. | Our model is 5'6\" and wears a size small.", "has_sizes": true, "price": "55.00", "rating": "4.80", "image_url": null, "image": "nikeoverheaddresshoodieW.jfif"}}, {"model": "products.product", "pk": 52, "fields": {"category": 6, "sku": null, "name": "Nike Sportswear Essential Oversized T-Shirt Women's", "description": "Steal his style with this women's Essential Logo Boyfriend T-Shirt from Nike. In a black colorway, this loose-fit tee is made from soft cotton for comfy vibes. With short sleeves and a crew neckline for a classic look, it's finished up with signature Swoosh branding to the front. Machine washable. | Our model is 5'6\" and wears a size small.", "has_sizes": true, "price": "23.00", "rating": "4.50", "image_url": null, "image": "nikeessoversizedTshirtW.jfif"}}, {"model": "products.product", "pk": 53, "fields": {"category": 6, "sku": null, "name": "Calvin Klein Core Boyfriend T-Shirt", "description": "From down days to weekend plans, freshen up your 'fit with this women's Core Boyfriend T-Shirt from Calvin Klein. In a white colorway, this oversized tee is made from soft cotton for comfort that lasts. It features a classic crew neckline, dropped shoulders, and relaxed sleeves for a laidback feel. Finished off with black CK branding on the chest and nape. Machine washable. | Our model is 5'7\" and wears a size small.", "has_sizes": true, "price": "35.00", "rating": "4.10", "image_url": null, "image": "ckboyfriendTshirtW.jfif"}}, {"model": "products.product", "pk": 54, "fields": {"category": 6, "sku": null, "name": "Champion Script Logo T-Shirt", "description": "Pick up a pastel look for the new season with this women's Script Logo T-Shirt from Champion. Coming in a pale pink colorway, this regular-fit essential is built from lightweight cotton for everyday comfort. Featuring a classic crew neckline and short sleeves, it's finished with signature Champion Script branding on the chest. Machine washable. | Our model is 5'7\" and wears a size small.", "has_sizes": true, "price": "23.00", "rating": "3.40", "image_url": null, "image": "championTshirtW.jfif"}}, {"model": "products.product", "pk": 55, "fields": {"category": 6, "sku": null, "name": "Nike Air Women's Top", "description": "Rep the Swoosh in style with this women's Nike Air Graphic Boyfriend T-Shirt. In a clean white colorway, this tee is made from light, durable cotton for a premium feel and all-day comfort. It features a crew neckline, short baggy sleeves, and dropped shoulders for a relaxed look. Finished up with Nike Air branding to the chest and sleeve. Machine washable | Our model is 5'6\" and wears a size small.", "has_sizes": true, "price": "27.00", "rating": "3.80", "image_url": null, "image": "nikeairtopW.jfif"}}, {"model": "products.product", "pk": 56, "fields": {"category": 6, "sku": null, "name": "Emporio Armani EA7 Tape Logo Long Sleeve T-Shirt", "description": "Add a little luxe to your look in this women's Tape Logo Long Sleeve T-Shirt from Emporio Armani EA7. In a sleek black colorway, this tee is made with soft and stretchy jersey cotton for a premium feel. This top features long sleeves for a comfortable fit with a classic crew neck. Finished with tape logo detailing to the sleeved and EA7 branding to the chest. | Our model is 5'6\" and wears a size small.", "has_sizes": true, "price": "65.00", "rating": "5.00", "image_url": null, "image": "ea7tapetopW.jfif"}}, {"model": "products.product", "pk": 57, "fields": {"category": 6, "sku": null, "name": "The North Face Fine Crop T-Shirt", "description": "Refresh your weekend style with this women's Fine Crop T-Shirt from The North Face. In a Rose Pink colorway, this cropped tee is made from soft cotton fabric for laidback comfort. It features a classic crew neckline and short sleeves. With a contrasting box graphic to the chest, this T-shirt is finished with signature The North Face branding. Machine washable. | Our model is 5'7\" and wears a size small.", "has_sizes": true, "price": "25.00", "rating": "4.75", "image_url": null, "image": "northfacecroptopW.jfif"}}, {"model": "products.product", "pk": 58, "fields": {"category": 6, "sku": null, "name": "adidas Originals Micro Trefoil Long Sleeve T-Shirt", "description": "Add a sleek style to your rotation with this women's Micro Trefoil Long Sleeve T-Shirt from Adidas Originals. Exclusive to JD, this long sleeve tee comes in a White colorway and is made with lightweight cotton fabric that'll keep you feelin' comfy throughout the day. It features a crew neckline with long sleeves that have ribbed cuffs for a snug fit. With repeat Trefoil branding to the sleeves, it's finished with a Trefoil to the chest. Machine washable. | Our model is 5'6\" and wears a size 8.", "has_sizes": true, "price": "30.00", "rating": "3.85", "image_url": null, "image": "adidasorignalLongtop.jfif"}}, {"model": "products.product", "pk": 59, "fields": {"category": 6, "sku": null, "name": "Nike Essential Futura Crop T-Shirt Women's", "description": "Keep it casual with this women's Essential Futura Crop T-Shirt from Nike. Made from soft cotton fabric, this loose-fitting tee has a classic crew neckline, short sleeves, and a cropped hem. In a grey colorway that pairs perfectly with some comfy leggings or joggers, it's finished up with bold Nike branding printed to the chest in black. | Our model is 5'6\" and wears a size 8.", "has_sizes": true, "price": "20.00", "rating": "4.90", "image_url": null, "image": "nikefuturatopW.jfif"}}, {"model": "products.product", "pk": 60, "fields": {"category": 6, "sku": null, "name": "Nike Essential Boyfriend T-Shirt", "description": "Cop a casual vibe for chill days with this women's Essential Boyfriend T-Shirt from Nike. In an Archaeo Pink colorway, this tee is made from smooth, durable cotton fabric for next-level comfort. It features dropped shoulders and armholes for a relaxed feel and comes in a baggy, oversized fit for spacious wear. With a crew neckline and short sleeves in a classic cut, this tee is finished up with a Nike Swoosh to the chest. Machine washable | Our model is 5'9\" and wears a size small.", "has_sizes": true, "price": "23.00", "rating": "4.00", "image_url": null, "image": "nikeessbftopW.jfif"}}, {"model": "products.product", "pk": 61, "fields": {"category": 6, "sku": null, "name": "Nike Essential Long-Sleeve Mock Neck Top", "description": "Lock in those laidback vibes with this women's Essential Long-Sleeve Mock Neck Top from Nike. In a smooth Black colorway, this tight-fit top is made from a stretchy cotton-poly fabric blend for ultra-comfy wear. It features a mock neck collar and long sleeves for full coverage and is signed off with a Nike Swoosh to the chest. Machine washable | Our model is 5'6\" and wears a size small.", "has_sizes": true, "price": "32.00", "rating": "4.60", "image_url": null, "image": "nikeesslongtopW.jfif"}}, {"model": "products.product", "pk": 62, "fields": {"category": 7, "sku": null, "name": "adidas Originals 3-Stripes Joggers", "description": "Sport a classic comfy look in these women's 3-Stripes Joggers from Adidas Originals. In a simple black colorway, these regular-fit joggers feature elasticated cuffs and a drawstring waist for custom wear. They're built from a soft cotton fleece for premium comfort and are finished with contrasting 3-Stripes to the side and a Trefoil logo. Machine washable. | Our model is 5'6\" and wears a size small.", "has_sizes": true, "price": "43.00", "rating": "4.00", "image_url": null, "image": "adidas3stripebotW.jfif"}}, {"model": "products.product", "pk": 63, "fields": {"category": 7, "sku": null, "name": "Nike Essential Futura Joggers", "description": "Level up ya off-duty looks with these women's Essential Futura Joggers from Nike. Landing in a Bronze Eclipse colourway, these regular-fit joggers are made with super-soft semi-brushed fleece for cosy comfy on chilled days. They feature an elasticated waistband with an adjustable drawcord for a custom feel, with side pockets to store ya gear when you head out. With elasticated ankle cuffs to elevate the fit, these joggers are signed off with the iconic Futura logo to the thigh. Machine washable. | Our model is 5'8\" and wears a size small.", "has_sizes": true, "price": "40.00", "rating": "3.80", "image_url": null, "image": "nikeessfuturabotW.jfif"}}, {"model": "products.product", "pk": 64, "fields": {"category": 7, "sku": null, "name": "Nike Sportswear Collection Essentials Women's Trousers", "description": "The Nike Sportswear Trousers feature pintuck details and are a relaxed fit to help you breeze through the working week. An elastic waist and cuffs give them a comfortable, snug fit.", "has_sizes": true, "price": "40.00", "rating": "3.90", "image_url": null, "image": "nikeesspurplebotW.jfif"}}, {"model": "products.product", "pk": 65, "fields": {"category": 7, "sku": null, "name": "JUICY COUTURE Crest Joggers", "description": "Flex a laidback look with these women's Crest Joggers from Juicy Couture. Comin' in a fresh White colorway, these regular-fit joggers are cut from super-soft cotton fleece for supreme comfy on chilled days. They feature an elasticated waistband with an adjustable drawcord for a custom feel and have elastic cuffs at the ankles to optimize the fit and show off ya sneaks. With side pockets to store the essentials, these joggers are signed off with Juicy Couture branding in contrast to Black down the leg. Machine washable. | Our model is 5'8\" and wears a size small", "has_sizes": true, "price": "65.00", "rating": "4.80", "image_url": null, "image": "jccrestbotW.jfif"}}, {"model": "products.product", "pk": 66, "fields": {"category": 7, "sku": null, "name": "JUICY COUTURE Diamante Velour Joggers", "description": "Kick back in JD exclusive style with these women's Diamante Velour Joggers from Juicy Couture. In a Pink colorway, these joggers are made from light, stretchy poly-blend fabric for an ultra-comfy feel. They feature an elasticated waistband with an adjustable drawcord for a relaxed fit, while cuffed ankles bring an optimized fit that lets you flex your fave treads. With side pockets for storing your essentials, these joggers are signed off with \"Juicy\" to the reverse and silver Diamante detailing. Machine washable | Our model is 5'5\" and wears a size small.", "has_sizes": true, "price": "65.00", "rating": "4.50", "image_url": null, "image": "jcdiamentebotW.jfif"}}, {"model": "products.product", "pk": 67, "fields": {"category": 7, "sku": null, "name": "Nike Plus Size Swoosh High Waist Leggings", "description": "Step up your comfort with these women's Plus Size Swoosh High Waist Leggings from Nike. These tight-fit leggings come in a Black colorway and are built with a soft, durable poly-cotton blend with added stretch for comfort and freedom of movement. They feature a high-rise design and a stretchy waistband for a snug and comfortable feel. These leggings are signed off with the famous Swoosh to each thigh. Machine washable. | Our model is 5'9\" and wears a size 1X.", "has_sizes": true, "price": "32.00", "rating": "3.25", "image_url": null, "image": "nikeswooshlegW.jfif"}}, {"model": "products.product", "pk": 68, "fields": {"category": 7, "sku": null, "name": "Nike Air Joggers Womens", "description": "Add some Swoosh to ya' essential style with these women's Air Joggers from Nike. Comin' in a Black colorway, these regular-fit joggers are made with soft, lightweight fleece cotton for supreme comfort. They feature an elasticated waistband with an adjustable drawcord for a custom feel, and elastic to the cuffs to show off ya' creps. With side pockets for added storage, these joggers are finished up with Nike Air branding up the leg and a small logo at the thigh to sign off. Machine washable. | Our model is 5'8\" and wears a size small.", "has_sizes": true, "price": "55.00", "rating": "4.50", "image_url": null, "image": "nikeairbotW.jfif"}}, {"model": "products.product", "pk": 69, "fields": {"category": 7, "sku": null, "name": "Nike Double Futura Joggers", "description": "Step out in JD-exclusive style in these women's Double Futura Joggers from Nike. In a Regal Pink colorway, these regular-fit joggers are cut from super-smooth cotton-blended fabric with brushed fleece for a cozy feel. They feature an elasticated waistband with adjustable drawcords for a snug fit, and elastic cuffs at the ankles to hold the shape and show off ya' creps. With two side pockets, these joggers are signed off with a double Futura graphic printed to the leg. Machine washable. | Our model is 5'8\" and wears a size small.", "has_sizes": true, "price": "40.00", "rating": "5.00", "image_url": null, "image": "nikefuturapinkbotW.jfif"}}, {"model": "products.product", "pk": 70, "fields": {"category": 7, "sku": null, "name": "Nike Tape Logo Fleece Joggers Womens", "description": "Bag some off-duty style with these women's Tape Logo Fleece Joggers from Nike. Made with soft semi-brushed fleece cotton, these standard-fit joggers have a lightweight feel for comfortable everyday wear. In a Dark Grey heather colorway, these joggers have an elasticated waistband with an adjustable drawcord for a custom feel, with ribbed cuffs to show off the kicks and 2 side pockets. Finished up with Nike branded taping down the legs for a retro-inspired look and a signature Swoosh at the thigh. Machine washable. | Our model is 5'6\" and wears a size small.", "has_sizes": true, "price": "45.00", "rating": "4.30", "image_url": null, "image": "niketapebotW.jfif"}}, {"model": "products.product", "pk": 71, "fields": {"category": 7, "sku": null, "name": "Nike Essential Cargo Joggers", "description": "Take your chill-day rotation up a notch with these women's Essential Cargo Joggers from Nike. In a Black colorway, these joggers are made using super-soft, semi-brushed fleece fabric for all-day comfort whenever you pull 'em on. They feature an elasticated, mid-rise waistband with adjustable drawcord for a relaxed, custom fit, with cuffed ankles so you can flex your fave treads. With side and cargo pockets for plenty of storage, these joggers are finished up with Nike branding on the leg. Machine washable | Our model wears a size small.", "has_sizes": true, "price": "45.00", "rating": "4.60", "image_url": null, "image": "nikeesscargobotW.jfif"}}, {"model": "products.product", "pk": 72, "fields": {"category": 8, "sku": null, "name": "The North Face Nuptse 1996 Jacket", "description": "Level up on warmth with this women's Nuptse 1996 Jacket from The North Face. Inspired by the OG Nuptse, this boxy-fit jacket is made from durable, water-resistant nylon, with a cozy RDS goose down for premium warmth when the weather goes south. It comes in a blue colourway and features a full zip fastening, a raised collar, and a bungee cinch hem for custom wear. With adjustable Velcro cuffs and zipped side pockets, this coat is finished with iconic TNF branding to the chest and back in white. Machine washable. | Our model is 5'5\" and wears a size small.", "has_sizes": true, "price": "270.00", "rating": "4.20", "image_url": null, "image": "northface1996bluejacketW.jfif"}}, {"model": "products.product", "pk": 73, "fields": {"category": 8, "sku": null, "name": "Champion Logo Padded Jacket", "description": "Keep out the cold in style with this women's Logo Padded Jacket from Champion. Coming in a Navy colorway, this padded jacket is built from lightweight poly fabric for durable comfort and has synthetic fill throughout to keep you feelin' toasty when the temperature dips. It has a full zip fastening for custom wear with a fixed hood for coverage from any downpours, the ribbed trims keep the heat locked in and the chills out. With two zippered pockets to the front for storage, this jacket is finished with famous Champion branding on the sleeve. Spot clean. | Our model is 5'7\" and wears a size small", "has_sizes": true, "price": "95.00", "rating": "4.00", "image_url": null, "image": "championpadjacketW.jfif"}}, {"model": "products.product", "pk": 74, "fields": {"category": 8, "sku": null, "name": "Levis Logo Padded Jacket", "description": "Step up your winter 'drobe with this women's Logo Padded Jacket from Levi's. In a Khaki colorway, this slim-fit jacket is made from durable poly fabric, with a lightweight yet insulated puffer design to keep you cozy. It features a full zip and button closure, as well as an adjustable toggle hood, elasticated trims, and side pockets. With toggles to cinch in the hem, this coat is finished with signature Levi's branding on the chest. Machine washable. | Our model is 5'7\" and wears a size small.", "has_sizes": true, "price": "110.00", "rating": "4.25", "image_url": null, "image": "levispadjacketW.jfif"}}, {"model": "products.product", "pk": 75, "fields": {"category": 8, "sku": null, "name": "Nike Tape Jacket Womens", "description": "Get cozy when there's a chill in the air with this women's Tape Jacket From Nike. In a Black colorway, this standard-fit jacket is made from lightweight recycled polyester with Nike Repel weather-resistant fabric to keep you dry and comfy at all times. It features Nike Therma-FIT tech to keep you warm, while the full-zip fastening, raised collar and hood provide protection from the elements. With side pockets for your essentials, this jacket is finished up with a Nike logo on the chest. Machine washable | Our model is 5'8\" and wears a size small.", "has_sizes": true, "price": "90.00", "rating": "4.00", "image_url": null, "image": "niketapejacketW.jfif"}}, {"model": "products.product", "pk": 76, "fields": {"category": 8, "sku": null, "name": "JUICY COUTURE Velour Padded Jacket", "description": "Set up for the new season in this women's Velour Padded Jacket from Juicy Couture. Comin' in a Black colorway, this oversized jacket is made with soft velour fabric for a classic JC look. Filled with synthetic down to lock in the heat, it features a full-length zipper and a funnel neckline, with a removable oversized hood for custom coverage. The sleeves have ribbed cuffs and there are adjustable bungee cords at the waist for the perf' fit. With snap-button pockets for secure storage, this jacket is finished up with a tonal logo patch at the sleeve. | Our model is 5'7\" and wears a size small.", "has_sizes": true, "price": "140.00", "rating": "4.90", "image_url": null, "image": "jcvelourjacketW.jfif"}}, {"model": "products.product", "pk": 77, "fields": {"category": 8, "sku": null, "name": "Champion Panel Padded Jacket", "description": "Don't let the cold stop you in your tracks with this women's Panel Padded Jacket from Champion. Coming in a White and Black colorway, this jacket is made from smooth poly fabric and has synthetic fill throughout to give you lightweight comfort and warmth. It features full zip fastening for custom wear and has a snap button closure to make sure no cold can creep in, the risen collar gives extra coverage and ribbed trims give you a snug, cozy fit. With two zippered pockets to the front for a warm place for your hands or to store your essentials, it's finished with Champion branding on the sleeve. Spot clean. | Our model wears a size small.", "has_sizes": true, "price": "110.00", "rating": "3.60", "image_url": null, "image": "championpanjacketW.jfif"}}, {"model": "products.product", "pk": 78, "fields": {"category": 8, "sku": null, "name": "adidas Badge of Sport Woven 1/4 Zip Jacket", "description": "Be street-ready whatever the weather with this women's Badge of Sport Woven 1/4 Zip Jacket from Adidas. Coming in a Black colorway, this jacket is built from smooth, lightweight poly fabric that's fast-drying if you get caught in any downpours. It features a 1/4 zip fastening for custom airflow and a hood with adjustable drawcords for custom coverage. With elasticated cuffs for a snug fit that keeps in the heat, it's signed off with the famous Badge of Sport logo to the center of the chest. Spot clean. | Our model is 5'7\" and wears a size small.", "has_sizes": true, "price": "50.00", "rating": "3.75", "image_url": null, "image": "adidaswovenjacketW.jfif"}}, {"model": "products.product", "pk": 79, "fields": {"category": 8, "sku": null, "name": "The North Face Mountain Athletics Wind Jacket", "description": "Cover up on cooler days with this women's Mountain Athletics Wind Jacket from The North Face. In a Black and White contrasting colorway for a stand-out look, this jacket is made from light, durable, wind-resistant polyester for warmth on blustery days. It features FlashDry moisture-wicking technology to keep you dry and comfy while meshing on the shoulders keeps air-flowing for breathability. With elasticated hems for an optimized fit and zippered pockets for secure storage, this jacket is signed off with the North Face 'Dome' logo to the chest and back. Our model is 5'6\" and wears a size small.", "has_sizes": true, "price": "80.00", "rating": "4.50", "image_url": null, "image": "northfacemountjacketW.jfif"}}, {"model": "products.product", "pk": 80, "fields": {"category": 8, "sku": null, "name": "Columbia Puffect Padded Jacket", "description": "Layer up and beat the cold in this women's Puffect Padded Jacket from Columbia. Comin' in a Grey colorway, this jacket is made with durable, water-resistant poly fabric and has a warming synthetic Thermarator insulation to lock in the heat. It features a full-length zipper and a funnel neckline to keep ya covered, and long sleeves with elasticated cuffs to hold 'em in place. With side pockets to store the essentials, this jacket is finished up with signature Columbia branding on the chest. | Our model is 5'6\" and wears a size small.", "has_sizes": true, "price": "115.00", "rating": "4.25", "image_url": null, "image": "columbiajacketW.jfif"}}, {"model": "products.product", "pk": 81, "fields": {"category": 8, "sku": null, "name": "adidas Terrex Multi RAIN.RDY Primegreen Allover Print 2L Rain Jacket", "description": "Showers. Wind. Sun. Or all of the above. When the forecast includes a little of everything, this adidas Terrex RAIN.RDY jacket has you covered. It seals out wet, stormy conditions, so you can get where you need to go while staying warm and dry. It's two-layer waterproof, breathable design lets you stay active and comfortable through cool, damp days. Pockets keep hands cozy and your everyday items secure. Get outside despite the weather. This product is made with Primegreen, a series of high-performance recycled materials.", "has_sizes": true, "price": "100.00", "rating": "3.80", "image_url": null, "image": "adidasterrexjacketW.jfif"}}]